library_assinment/app/controllers/book_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books"
---
    def index
        # curr_usr=User.find_by_id(session[:current_user_id])
        curr_usr=User.find(1)
        puts "******************Book Index*****************************"
        puts session[:current_user_id]
        bk_lst=Book.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "books" ("bookName", "bookAuthor", "bookQuantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bookName", "Test"], ["bookAuthor", "Test"], ["bookQuantity", 1], ["created_at", "2023-01-20 18:10:12.758296"], ["updated_at", "2023-01-20 18:10:12.758296"]]
---
    def create
        puts ("test")
        puts params[:bookAuthor]
        # curr_usr=User.find_by_id(session[:current_user_id])
        curr_usr=User.find(1)

        # if(curr_usr.nil? || curr_usr.userEmail !="admin.lib@gmail.com")
            if(curr_usr.nil?)
            render json: "Only Admin can edit Book details"
        else
        Book.create('bookName': params[:bookName],
            'bookAuthor': params[:bookAuthor],
            'bookQuantity': params[:bookQuantity] )

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "bookQuantity" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["bookQuantity", 7], ["updated_at", "2023-01-17 17:41:57.898213"], ["id", 5]]
---
    def update
        p=Book.find(params[:id].to_i)
        # curr_usr=User.find_by_id(session[:current_user_id])
        curr_usr=User.find(1)

        puts params[:bookName]
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
        p.update('bookName': params[:bookName],
        'bookAuthor': params[:bookAuthor],
        'bookQuantity': params[:bookQuantity] )

SELECT "books".* FROM "books" WHERE "books"."bookName" = $1 LIMIT $2  [["bookName", "Check Update"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "bookQuantity" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["bookQuantity", 7], ["updated_at", "2023-01-17 17:41:57.898213"], ["id", 5]]
---
    def modify
        p=Book.find_by('bookName': params[:bookName])
        # curr_usr=User.find_by_id(session[:current_user_id])
        curr_usr=User.find(1)
        puts params[:bookName]
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
        p.update('bookName': params[:bookName],
        'bookAuthor': params[:bookAuthor],
        'bookQuantity': params[:bookQuantity] )

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 5]]
---
    def destroy
        p = Book.find(params[:id])
        # curr_usr=User.find_by_id(session[:current_user_id])
        curr_usr=User.find(1)
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
        p.destroy

SELECT "books".* FROM "books" WHERE "books"."bookName" = $1 LIMIT $2  [["bookName", "Check Update"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 5]]
---
    def delete
        p = Book.find_by('bookName': params[:bookName])
        # curr_usr=User.find_by_id(session[:current_user_id])
        curr_usr=User.find(1)
        if(curr_usr.nil?)
            render json: "Not logged in"
        else
        p.destroy