library_assinment/app/controllers/login_controller.rb

def create
    usr = User.find_by('userEmail': params[:userEmail])
---
SELECT "users".* FROM "users" WHERE "users"."userEmail" = $1 LIMIT $2  [["userEmail", "test2@gmail.com"], ["LIMIT", 1]]