library_assinment/app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        puts "******************User Index***********************"
        curr_usr=User.find_by_id(session[:current_user_id])
        if(curr_usr.nil?)
            render json: "Not logged in"
        elsif(curr_usr.userEmail !="admin.lib@gmail.com")
            render json: curr_usr
        else
            render json: User.all

INSERT INTO "users" ("userName", "userEmail", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["userName", "Test23"], ["userEmail", "Test23@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-01-20 04:25:25.857171"], ["updated_at", "2023-01-20 04:25:25.857171"]]
---
    def create

            puts "******************User Create***********************"


          p=User.create('userName': params[:userName],
            'userEmail': params[:userEmail],
            'password': params[:password])

SELECT "users".* FROM "users"
---
    def show
        v = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."userEmail" = $1 LIMIT $2  [["userEmail", "Test23@gmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2023-01-20 04:45:25.012957"], ["id", 4]]
---
    def update
        puts "******************User Update***********************"
    curr_usr=User.find_by_id(session[:current_user_id])
    if(curr_usr.nil?)
        render json:"Please login to update"
    else

        p=User.find_by('userEmail': params[:userEmail])
        p.update( 'password': params[:password] )